cmcmicrosystems/iot_platform/Firmware/source/BLEsensor_cc2650lp_app/BSP_Drivers/bspBoard.c
/*
 * bspBoard.c
 *
 *  Created on: 14-Nov-2017
 *      Author: Niraj
 */



/*
 *  ====================== CC2650_LAUNCHXL.c ===================================
 *  This file is responsible for setting up the board specific items for the
 *  CC2650 LaunchPad.
 */


/*
 *  ====================== Includes ============================================
 */
#include <xdc/std.h>
#include <xdc/runtime/System.h>

#include <ti/sysbios/family/arm/m3/Hwi.h>
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

#include <inc/hw_memmap.h>
#include <inc/hw_ints.h>
#include <driverlib/ioc.h>
#include <driverlib/udma.h>

#include "bspBoard.h"

/*
 *  ========================= IO driver initialization =========================
 *  From main, PIN_init(BoardGpioInitTable) should be called to setup safe
 *  settings for this board.
 *  When a pin is allocated and then de-allocated, it will revert to the state
 *  configured in this table.
*/

/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(BoardGpioInitTable, ".const:BoardGpioInitTable")
#pragma DATA_SECTION(PINCC26XX_hwAttrs, ".const:PINCC26XX_hwAttrs")
#endif

const PIN_Config BoardGpioInitTable[] = {

    Board_RLED   | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,         /* LED initially off             */
    Board_ADX_INT1 | PIN_INPUT_EN | PIN_PULLUP ,
    Board_ADX_INT2 | PIN_INPUT_EN | PIN_PULLUP ,
    Board_OPT3001_INT | PIN_INPUT_EN | PIN_PULLUP ,
//    Board_GLED   | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,         /* LED initially off             */
//    Board_BTN1   | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,            /* Button is active low          */
//    Board_BTN2   | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,            /* Button is active low          */
    Board_SPI_ADX_CS | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL | PIN_DRVSTR_MAX,  /* External flash chip select    */
//    Board_UART_RX | PIN_INPUT_EN | PIN_PULLDOWN,                                              /* UART RX via debugger back channel */
//    Board_UART_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,                        /* UART TX via debugger back channel */
    Board_SPI0_MOSI | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master out - slave in */
    Board_SPI0_MISO | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master in - slave out */
    Board_SPI0_CLK | PIN_INPUT_EN | PIN_PULLDOWN,                                             /* SPI clock */

    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};
/*============================================================================*/

/*
 *  ============================= Power begin ==================================
 */
const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = TRUE,
    .calibrateRCOSC_LF  = TRUE,
    .calibrateRCOSC_HF  = TRUE,
};
/*
 *  ============================= Power end ====================================
 */

///*
// *  ============================= UART begin ===================================
// */
//#if defined(__TI_COMPILER_VERSION__)
//#pragma DATA_SECTION(UART_config, ".const:UART_config")
//#pragma DATA_SECTION(uartCC26XXHWAttrs, ".const:uartCC26XXHWAttrs")
//#endif
//
///* Include drivers */
//#include <ti/drivers/UART.h>
//#include <ti/drivers/uart/UARTCC26XX.h>
//
///* UART objects */
//UARTCC26XX_Object uartCC26XXObjects[CC2650_LAUNCHXL_UARTCOUNT];
//
///* UART hardware parameter structure, also used to assign UART pins */
//const UARTCC26XX_HWAttrsV1 uartCC26XXHWAttrs[CC2650_LAUNCHXL_UARTCOUNT] = {
//    {
//        .baseAddr       = UART0_BASE,
//        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
//        .intNum         = INT_UART0_COMB,
//        .intPriority    = ~0,
//        .swiPriority    = 0,
//        .txPin          = Board_UART_TX,
//        .rxPin          = Board_UART_RX,
//        .ctsPin         = PIN_UNASSIGNED,
//        .rtsPin         = PIN_UNASSIGNED
//    }
//};
//
///* UART configuration structure */
//const UART_Config UART_config[] = {
//    {
//        .fxnTablePtr = &UARTCC26XX_fxnTable,
//        .object      = &uartCC26XXObjects[0],
//        .hwAttrs     = &uartCC26XXHWAttrs[0]
//    },
//    {NULL, NULL, NULL}
//};
///*
// *  ============================= UART end =====================================
// */

/*
 *  ============================= UDMA begin ===================================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(UDMACC26XX_config, ".const:UDMACC26XX_config")
#pragma DATA_SECTION(udmaHWAttrs, ".const:udmaHWAttrs")
#endif

/* Include drivers */
#include <ti/drivers/dma/UDMACC26XX.h>

/* UDMA objects */
UDMACC26XX_Object udmaObjects[CC2650_LAUNCHXL_UDMACOUNT];

/* UDMA configuration structure */
const UDMACC26XX_HWAttrs udmaHWAttrs[CC2650_LAUNCHXL_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

/* UDMA configuration structure */
const UDMACC26XX_Config UDMACC26XX_config[] = {
    {
         .object  = &udmaObjects[0],
         .hwAttrs = &udmaHWAttrs[0]
    },
    {NULL, NULL}
};
/*
 *  ============================= UDMA end =====================================
 */

/*
 *  ========================== SPI DMA begin ===================================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(SPI_config, ".const:SPI_config")
#pragma DATA_SECTION(spiCC26XXDMAHWAttrs, ".const:spiCC26XXDMAHWAttrs")
#endif

/* Include drivers */
#include <ti/drivers/spi/SPICC26XXDMA.h>

/* SPI objects */
SPICC26XXDMA_Object spiCC26XXDMAObjects[CC2650_LAUNCHXL_SPICOUNT];

/* SPI configuration structure, describing which pins are to be used */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC2650_LAUNCHXL_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = Board_SPI0_MOSI,
        .misoPin            = Board_SPI0_MISO,
        .clkPin             = Board_SPI0_CLK,
        .csnPin             = Board_SPI0_CSN
    },
//    {
//        .baseAddr           = SSI1_BASE,
//        .intNum             = INT_SSI1_COMB,
//        .intPriority        = ~0,
//        .swiPriority        = 0,
//        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
//        .defaultTxBufValue  = 0,
//        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
//        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
//        .mosiPin            = Board_SPI1_MOSI,
//        .misoPin            = Board_SPI1_MISO,
//        .clkPin             = Board_SPI1_CLK,
//        .csnPin             = Board_SPI1_CSN
//    }
};

/* SPI configuration structure */
const SPI_Config SPI_config[] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[0]
    },
//    {
//         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
//         .object      = &spiCC26XXDMAObjects[1],
//         .hwAttrs     = &spiCC26XXDMAHWAttrs[1]
//    },
    {NULL, NULL, NULL}
};
/*
 *  ========================== SPI DMA end =====================================
*/

/*
 *  ============================= I2C Begin=====================================
*/
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(I2C_config, ".const:I2C_config")
#pragma DATA_SECTION(i2cCC26xxHWAttrs, ".const:i2cCC26xxHWAttrs")
#endif

/* Include drivers */
#include <ti/drivers/i2c/I2CCC26XX.h>

/* I2C objects */
I2CCC26XX_Object i2cCC26xxObjects[CC2650_LAUNCHXL_I2CCOUNT];

/* I2C configuration structure, describing which pins are to be used */
const I2CCC26XX_HWAttrsV1 i2cCC26xxHWAttrs[CC2650_LAUNCHXL_I2CCOUNT] = {
    {
        .baseAddr = I2C0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_I2C0,
        .intNum = INT_I2C_IRQ,
        .intPriority = ~0,
        .swiPriority = 0,
        .sdaPin = Board_I2C0_SDA0,
        .sclPin = Board_I2C0_SCL0,
    }
};

/* I2C configuration structure */
const I2C_Config I2C_config[] = {
    {
        .fxnTablePtr = &I2CCC26XX_fxnTable,
        .object = &i2cCC26xxObjects[0],
        .hwAttrs = &i2cCC26xxHWAttrs[0]
    },
    {NULL, NULL, NULL}
};
/*
 *  ========================== I2C end =========================================
 */

/*
 *  ========================== Crypto begin ====================================
 *  NOTE: The Crypto implementation should be considered experimental
 *        and not validated!
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(CryptoCC26XX_config, ".const:CryptoCC26XX_config")
#pragma DATA_SECTION(cryptoCC26XXHWAttrs, ".const:cryptoCC26XXHWAttrs")
#endif

/* Include drivers */
#include <ti/drivers/crypto/CryptoCC26XX.h>

/* Crypto objects */
CryptoCC26XX_Object cryptoCC26XXObjects[CC2650_LAUNCHXL_CRYPTOCOUNT];

/* Crypto configuration structure, describing which pins are to be used */
const CryptoCC26XX_HWAttrs cryptoCC26XXHWAttrs[CC2650_LAUNCHXL_CRYPTOCOUNT] = {
    {
        .baseAddr       = CRYPTO_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_CRYPTO,
        .intNum         = INT_CRYPTO_RESULT_AVAIL_IRQ,
        .intPriority    = ~0,
    }
};

/* Crypto configuration structure */
const CryptoCC26XX_Config CryptoCC26XX_config[] = {
    {
         .object  = &cryptoCC26XXObjects[0],
         .hwAttrs = &cryptoCC26XXHWAttrs[0]
    },
    {NULL, NULL}
};
/*
 *  ========================== Crypto end ======================================
 */



/*
 *  ========================= RF driver begin ==================================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(RFCC26XX_hwAttrs, ".const:RFCC26XX_hwAttrs")
#endif

/* Include drivers */
#include <ti/drivers/rf/RF.h>

/* RF hwi and swi priority */
const RFCC26XX_HWAttrs RFCC26XX_hwAttrs = {
    .hwiCpe0Priority = ~0,
    .hwiHwPriority   = ~0,
    .swiCpe0Priority =  5,
    .swiHwPriority   =  5,
};

/*
 *  ========================== RF driver end ===================================
 */
//
///*
// *  ========================= Display begin ====================================
// */
///* Place into subsections to allow the TI linker to remove items properly */
//#if defined(__TI_COMPILER_VERSION__)
//#pragma DATA_SECTION(Display_config, ".const:Display_config")
//#pragma DATA_SECTION(displaySharpHWattrs, ".const:displaySharpHWattrs")
//#pragma DATA_SECTION(displayUartHWAttrs, ".const:displayUartHWAttrs")
//#endif
//
//#include <ti/mw/display/Display.h>
//#include <ti/mw/display/DisplaySharp.h>
//#include <ti/mw/display/DisplayUart.h>
//
///* Structures for UartPlain Blocking */
//DisplayUart_Object        displayUartObject;
//
//#ifndef BOARD_DISPLAY_UART_STRBUF_SIZE
//#define BOARD_DISPLAY_UART_STRBUF_SIZE    128
//#endif
//static char uartStringBuf[BOARD_DISPLAY_UART_STRBUF_SIZE];
//
//const DisplayUart_HWAttrs displayUartHWAttrs = {
//    .uartIdx      = Board_UART,
//    .baudRate     =     115200,
//    .mutexTimeout = BIOS_WAIT_FOREVER,
//    .strBuf = uartStringBuf,
//    .strBufLen = BOARD_DISPLAY_UART_STRBUF_SIZE,
//};
//
///* Structures for SHARP */
//DisplaySharp_Object displaySharpObject;
//
//#ifndef BOARD_DISPLAY_SHARP_SIZE
//#define BOARD_DISPLAY_SHARP_SIZE    96 // 96->96x96 is the most common board, alternative is 128->128x128.
//#endif
//static uint8_t sharpDisplayBuf[BOARD_DISPLAY_SHARP_SIZE * BOARD_DISPLAY_SHARP_SIZE / 8];
//
//const DisplaySharp_HWAttrs displaySharpHWattrs = {
//    .spiIndex    = Board_SPI0,
//    .csPin       = Board_LCD_CS,
//    .extcominPin = Board_LCD_EXTCOMIN,
//    .powerPin    = Board_LCD_POWER,
//    .enablePin   = Board_LCD_ENABLE,
//    .pixelWidth  = BOARD_DISPLAY_SHARP_SIZE,
//    .pixelHeight = BOARD_DISPLAY_SHARP_SIZE,
//    .displayBuf  = sharpDisplayBuf,
//};
//
///* Array of displays */
//const Display_Config Display_config[] = {
//#if !defined(BOARD_DISPLAY_EXCLUDE_UART)
//    {
//        .fxnTablePtr = &DisplayUart_fxnTable,
//        .object      = &displayUartObject,
//        .hwAttrs     = &displayUartHWAttrs,
//    },
//#endif
//#if !defined(BOARD_DISPLAY_EXCLUDE_LCD)
//    {
//        .fxnTablePtr = &DisplaySharp_fxnTable,
//        .object      = &displaySharpObject,
//        .hwAttrs     = &displaySharpHWattrs
//    },
//#endif
//    { NULL, NULL, NULL } // Terminator
//};
//
///*
// *  ========================= Display end ======================================
// */
//
//
///*
// *  ========================= TRNG begin ====================================
// */
///* Place into subsections to allow the TI linker to remove items properly */
//#if defined(__TI_COMPILER_VERSION__)
//#pragma DATA_SECTION(TRNGCC26XX_config, ".const:TRNGCC26XX_config")
//#pragma DATA_SECTION(TRNGCC26XXHWAttrs, ".const:TRNGCC26XXHWAttrs")
//#endif
//
///* Include drivers */
//#include <TRNGCC26XX.h>
//
///* TRNG objects */
//TRNGCC26XX_Object trngCC26XXObjects[CC2650_LAUNCHXL_TRNGCOUNT];
//
///* TRNG configuration structure, describing which pins are to be used */
//const TRNGCC26XX_HWAttrs TRNGCC26XXHWAttrs[CC2650_LAUNCHXL_TRNGCOUNT] = {
//    {
//        .powerMngrId    = PowerCC26XX_PERIPH_TRNG,
//    }
//};
//
///* TRNG configuration structure */
//const TRNGCC26XX_Config TRNGCC26XX_config[] = {
//    {
//         .object  = &trngCC26XXObjects[0],
//         .hwAttrs = &TRNGCC26XXHWAttrs[0]
//    },
//    {NULL, NULL}
//};
//
///*
// *  ========================= TRNG end ====================================
// */
